# Ejercicios diarios mySQL

In [1]:
## Conectarse a docker y pandas
import pandas as pd
import os
from sqlalchemy import create_engine

In [2]:
from dotenv import load_dotenv
import cryptography
load_dotenv("credenciales_mysql.env")

True

In [3]:
user = os.getenv("MYSQL_USER", "root")
pwd  = os.environ["MYSQL_PASSWORD"]
host = os.getenv("MYSQL_HOST", "127.0.0.1")
port = os.getenv("MYSQL_PORT", "3306")
db   = os.getenv("MYSQL_DB", "sakila")

engine = create_engine(f"mysql+pymysql://{user}:{pwd}@{host}:{port}/{db}")

In [5]:
df = pd.read_sql("SELECT category, COUNT(*) AS n FROM film_list GROUP BY category ORDER BY n DESC;", engine)
df.head()

      category   n
0       Sports  74
1      Foreign  73
2       Family  69
3  Documentary  68
4    Animation  66

In [6]:
pd.read_sql("SHOW TABLES;", engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [7]:
pd.read_sql("DESCRIBE film_list;", engine)

         Field                                Type Null Key Default Extra
0          FID                   smallint unsigned   NO           0
1        title                        varchar(128)   NO         NaN
2  description                                text  YES         NaN
3     category                         varchar(25)  YES         NaN
4        price                        decimal(4,2)   NO        4.99
5       length                   smallint unsigned  YES         NaN
6       rating  enum('G','PG','PG-13','R','NC-17')  YES           G
7       actors                                text  YES         NaN

In [17]:
pd.read_sql("SELECT title FROM film_list;", engine)

                 title
0     ACADEMY DINOSAUR
1       ACE GOLDFINGER
2     ADAPTATION HOLES
3     AFFAIR PREJUDICE
4          AFRICAN EGG
..                 ...
995     YOUNG LANGUAGE
996         YOUTH KICK
997       ZHIVAGO CORE
998  ZOOLANDER FICTION
999          ZORRO ARK

[1000 rows x 1 columns]

In [8]:
pd.read_sql("SELECT title FROM film_list WHERE category = 'Documentary';", engine)

                  title
0      ACADEMY DINOSAUR
1      ADAPTATION HOLES
2      ARMY FLINTSTONES
3   BEACH HEARTBREAKERS
4          BED HIGHBALL
..                  ...
63           WARS PLUTO
64       WEDDING APOLLO
65            WIFE TURN
66           WRATH MILE
67       YOUNG LANGUAGE

[68 rows x 1 columns]

In [13]:
pd.read_sql("SELECT * FROM film_list WHERE price BETWEEN 1 AND 3;", engine)

,FID,title,description,category,price,length,rating,actors
0,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"NICK WAHLBERG, BOB FAWCETT, CAMERON STREEP, RA..."
1,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"JODIE DEGENERES, SCARLETT DAMON, KENNETH PESCI..."
2,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"DUSTIN TAUTOU, THORA TEMPLE, MATTHEW CARREY, M..."
3,6,AGENT TRUMAN,A Intrepid Panorama of a Robot And a Boy who m...,Foreign,2.99,169,PG,"KIRSTEN PALTROW, SANDRA KILMER, JAYNE NEESON, ..."
4,9,ALABAMA DEVIL,A Thoughtful Panorama of a Database Administra...,Horror,2.99,114,PG-13,"WARREN NOLTE, GRETA KEITEL, WILLIAM HACKMAN, M..."
...,...,...,...,...,...,...,...,...
318,987,WORDS HUNTER,A Action-Packed Reflection of a Composer And a...,Music,2.99,116,PG,"GENE WILLIS, SUSAN DAVIS, SCARLETT BENING, ADA..."
319,988,WORKER TARZAN,A Action-Packed Yarn of a Secret Agent And a T...,Travel,2.99,139,R,"JULIANNE DENCH, ROCK DUKAKIS, MERYL GIBSON, MI..."
320,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,Action,2.99,185,PG,"PARKER GOLDBERG, KIRSTEN AKROYD, SPENCER DEPP,..."
321,993,WRONG BEHAVIOR,A Emotional Saga of a Crocodile And a Sumo Wre...,Children,2.99,178,PG-13,"THORA TEMPLE, GARY PHOENIX, GREGORY GOODING, M..."
322,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,Children,2.99,101,R,"CARMEN HUNT, MARY TANDY, PENELOPE CRONYN, WHOO..."

In [14]:
pd.read_sql("SELECT * FROM film_list WHERE price > 1 AND price < 3;", engine)

,FID,title,description,category,price,length,rating,actors
0,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"NICK WAHLBERG, BOB FAWCETT, CAMERON STREEP, RA..."
1,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"JODIE DEGENERES, SCARLETT DAMON, KENNETH PESCI..."
2,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"DUSTIN TAUTOU, THORA TEMPLE, MATTHEW CARREY, M..."
3,6,AGENT TRUMAN,A Intrepid Panorama of a Robot And a Boy who m...,Foreign,2.99,169,PG,"KIRSTEN PALTROW, SANDRA KILMER, JAYNE NEESON, ..."
4,9,ALABAMA DEVIL,A Thoughtful Panorama of a Database Administra...,Horror,2.99,114,PG-13,"WARREN NOLTE, GRETA KEITEL, WILLIAM HACKMAN, M..."
...,...,...,...,...,...,...,...,...
318,987,WORDS HUNTER,A Action-Packed Reflection of a Composer And a...,Music,2.99,116,PG,"GENE WILLIS, SUSAN DAVIS, SCARLETT BENING, ADA..."
319,988,WORKER TARZAN,A Action-Packed Yarn of a Secret Agent And a T...,Travel,2.99,139,R,"JULIANNE DENCH, ROCK DUKAKIS, MERYL GIBSON, MI..."
320,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,Action,2.99,185,PG,"PARKER GOLDBERG, KIRSTEN AKROYD, SPENCER DEPP,..."
321,993,WRONG BEHAVIOR,A Emotional Saga of a Crocodile And a Sumo Wre...,Children,2.99,178,PG-13,"THORA TEMPLE, GARY PHOENIX, GREGORY GOODING, M..."
322,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,Children,2.99,101,R,"CARMEN HUNT, MARY TANDY, PENELOPE CRONYN, WHOO..."

In [16]:
pd.read_sql("DESCRIBE actor_info;", engine)

        Field               Type Null Key Default Extra
0    actor_id  smallint unsigned   NO           0
1  first_name        varchar(45)   NO         NaN
2   last_name        varchar(45)   NO         NaN
3   film_info               text  YES         NaN

In [18]:
pd.read_sql("DESCRIBE country;", engine)

,Field,Type,Null,Key,Default,Extra
0,country_id,smallint unsigned,NO,PRI,NaN,auto_increment
1,country,varchar(50),NO,,NaN,
2,last_update,timestamp,NO,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [27]:
# No olvidar poner comillas al dato de la variable categorica (no olvidar poner comillas a Algeria)
pd.read_sql("SELECT * FROM country WHERE country != 'Algeria';", engine)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 04:44:00
1             3        American Samoa 2006-02-15 04:44:00
2             4                Angola 2006-02-15 04:44:00
3             5              Anguilla 2006-02-15 04:44:00
4             6             Argentina 2006-02-15 04:44:00
..          ...                   ...                 ...
103         105               Vietnam 2006-02-15 04:44:00
104         106  Virgin Islands, U.S. 2006-02-15 04:44:00
105         107                 Yemen 2006-02-15 04:44:00
106         108            Yugoslavia 2006-02-15 04:44:00
107         109                Zambia 2006-02-15 04:44:00

[108 rows x 3 columns]

In [28]:
pd.read_sql("SELECT * FROM country WHERE country <> 'Algeria';", engine)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 04:44:00
1             3        American Samoa 2006-02-15 04:44:00
2             4                Angola 2006-02-15 04:44:00
3             5              Anguilla 2006-02-15 04:44:00
4             6             Argentina 2006-02-15 04:44:00
..          ...                   ...                 ...
103         105               Vietnam 2006-02-15 04:44:00
104         106  Virgin Islands, U.S. 2006-02-15 04:44:00
105         107                 Yemen 2006-02-15 04:44:00
106         108            Yugoslavia 2006-02-15 04:44:00
107         109                Zambia 2006-02-15 04:44:00

[108 rows x 3 columns]

In [30]:
pd.read_sql("SELECT * FROM country WHERE country NOT IN ('Algeria', 'ARGENTINA');", engine)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 04:44:00
1             3        American Samoa 2006-02-15 04:44:00
2             4                Angola 2006-02-15 04:44:00
3             5              Anguilla 2006-02-15 04:44:00
4             7               Armenia 2006-02-15 04:44:00
..          ...                   ...                 ...
102         105               Vietnam 2006-02-15 04:44:00
103         106  Virgin Islands, U.S. 2006-02-15 04:44:00
104         107                 Yemen 2006-02-15 04:44:00
105         108            Yugoslavia 2006-02-15 04:44:00
106         109                Zambia 2006-02-15 04:44:00

[107 rows x 3 columns]